/*
                                                      Задача

-Створити асинхронний метод, який асинхронно читатиме з файлу "Hello"
-Створити асинхронний метод, який асинхронно читатиме з іншого файлу "World"
-Створити асинхронний метод, у якому асинхронно виконуватимуться методи витягування тексту.
    Дочекатися паралельне виконання двох методів та повернуть конкатенацію текстів як результат поточного методу.
-Синхронно запустити метод, який повертає результат контатенації

 */

namespace ReadTextAsyncFromFiles
{
    public class Program
    {
        public static void Main(string[] args)
        {
            Starter.Run();

            Console.Write("\nPress any key to continue . . .");
            Console.ReadLine();
        }
    }
}